app/controllers/api/v1/news_articles_controller.rb

    def index
        news_articles = NewsArticle.all
---
SELECT "news_articles".* FROM "news_articles"