app/models/news_article.rb

DELETE FROM "news_articles" WHERE "news_articles"."id" = $1  [["id", 1]]
SELECT "news_articles".* FROM "news_articles"
INSERT INTO "news_articles" ("title", "source", "author", "description", "url", "img", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def self.get_data
        self.destroy_all
        key = ENV['API_KEY']

        url = 'http://newsapi.org/v2/top-headlines?'\
        'country=us&'\
        "#{key}"
        req = open(url)
        response_body = req.read
        data = JSON.parse(response_body)
        articles = data['articles']

        articles.map do |article|
            author = NewsArticle.create(title: article['title'], source: article['source']['name'], author: article['author'], description: article['description'], url: article['url'], img: article['urlToImage'])